In [1]:
import pandas as pd
import numpy as np

In [3]:
data=pd.DataFrame({"A":np.random.randint(1,10,10),
                   "B":np.random.randint(1,10,10),
                   "C":np.random.randint(1,10,10),
                   "D":np.random.randint(1,10,10)})

In [5]:
data.to_csv("sample.csv")

In [41]:
data=pd.read_csv("sample.csv",index_col=None)

In [44]:
data=data.drop("Unnamed: 0",axis=1)

In [45]:
data

   A  B  C  D
0  2  7  6  1
1  2  2  7  7
2  9  7  8  3
3  9  6  6  7
4  1  4  2  2
5  3  3  1  5
6  2  8  4  7
7  5  5  5  4
8  2  6  9  6
9  6  5  6  7

In [46]:
list(open('sample.csv'))

[',A,B,C,D\n',
 '0,2,7,6,1\n',
 '1,2,2,7,7\n',
 '2,9,7,8,3\n',
 '3,9,6,6,7\n',
 '4,1,4,2,2\n',
 '5,3,3,1,5\n',
 '6,2,8,4,7\n',
 '7,5,5,5,4\n',
 '8,2,6,9,6\n',
 '9,6,5,6,7\n']

In [53]:
data=pd.read_csv('sample.csv',nrows=5)

In [54]:
data

   Unnamed: 0  A  B  C  D
0           0  2  7  6  1
1           1  2  2  7  7
2           2  9  7  8  3
3           3  9  6  6  7
4           4  1  4  2  2

In [63]:
import csv
data=open('sample.csv')
a=csv.reader(data)
for i in a:
    print(i)

['', 'A', 'B', 'C', 'D']
['0', '2', '7', '6', '1']
['1', '2', '2', '7', '7']
['2', '9', '7', '8', '3']
['3', '9', '6', '6', '7']
['4', '1', '4', '2', '2']
['5', '3', '3', '1', '5']
['6', '2', '8', '4', '7']
['7', '5', '5', '5', '4']
['8', '2', '6', '9', '6']
['9', '6', '5', '6', '7']

In [65]:
with open('sample.csv') as f:
    lines=list(csv.reader(f))
lines

[['', 'A', 'B', 'C', 'D'],
 ['0', '2', '7', '6', '1'],
 ['1', '2', '2', '7', '7'],
 ['2', '9', '7', '8', '3'],
 ['3', '9', '6', '6', '7'],
 ['4', '1', '4', '2', '2'],
 ['5', '3', '3', '1', '5'],
 ['6', '2', '8', '4', '7'],
 ['7', '5', '5', '5', '4'],
 ['8', '2', '6', '9', '6'],
 ['9', '6', '5', '6', '7']]

In [85]:
# json data
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [86]:
import json
res=json.loads(obj)

In [87]:
res

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [88]:
asjson=json.dumps(res)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [92]:
siblings=pd.DataFrame(res['siblings'])
siblings
siblings.to_json("a.json")

In [101]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 9E31-57CF

 Directory of C:\Users\RINSU\A_data_science_Practise\A_Python Data analysis handbook\Storage

03/21/2020  02:57 PM    <DIR>          .
03/21/2020  02:57 PM    <DIR>          ..
03/21/2020  11:25 AM    <DIR>          .ipynb_checkpoints
03/21/2020  02:57 PM               116 a.json
03/21/2020  11:38 AM               120 sample.csv
03/21/2020  02:57 PM            14,597 Untitled.ipynb
               3 File(s)         14,833 bytes
               3 Dir(s)  134,219,108,352 bytes free

In [104]:
a=pd.read_json('a.json')
a

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [105]:
a.to_json()

'{"name":{"0":"Scott","1":"Katie"},"age":{"0":30,"1":38},"pets":{"0":["Zeus","Zuko"],"1":["Sixes","Stache","Cisco"]}}'

In [107]:
a.to_clipboard()

In [114]:
tables=pd.read_html('FDIC_ Failed Bank List.html')
len(tables)

1

In [117]:
failures=tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"

In [124]:
close_timestamps=pd.to_datetime(failures['Closing Date'])

In [128]:
close_timestamps.dt.year.value_counts()

2017    8
2015    7
2016    5
2019    4
2020    1
Name: Closing Date, dtype: int64

In [129]:
close_timestamps.dt.month.value_counts()

10    5
5     5
2     3
1     3
4     2
3     2
12    1
11    1
9     1
8     1
7     1
Name: Closing Date, dtype: int64

In [130]:
close_timestamps.dt.day.value_counts()

13    3
2     2
27    2
25    2
23    2
31    1
10    1
3     1
5     1
6     1
8     1
14    1
11    1
29    1
15    1
19    1
26    1
28    1
1     1
Name: Closing Date, dtype: int64